<?php

namespace Database\Seeders;

use App\Models\LogAction;
use Illuminate\Database\Seeder;

class LogActionSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        //
        $data = [
            'تسجيل دخول مستخدم',
            'تغيير كلمة المرور',
            'إنشاء حساب شركة حجاج داخل',
            'إنشاء حساب مكتب هندسي',
            'إنشاء حساب مقاول',
            'تغيير كلمة المرور',
            'تعديل بيانات المستخدم',
            'إضافة توقيع',
            'تعديل توقيع',
            'حذف توقيع',
            'إضافة دور جديد',
            'تعديل دور',
            'حذف دور',
            'إضافة صلاحية لدور',
            'تعديل صلاحية لدور',
            'حذف صلاحية لدور',
            'إنشاء مستخدم',
            'تعديل بيانات مستخدم',
            'إضافة توقيع لمستخدم',
            'حذف مستخدم',
            'تفعيل حساب مستخدم',
            'تعطيل حساب مستخدم',
            'إضافة دور المستخدم',
            'تعديل دور للمستخدم',
            'تفعيل طلب إنشاء حساب لمستخدم',
            'رفض طلب إنشاء حساب لمستخدم',
            'تعديل نوع مستخدم',
            'تفعيل نوع مستخدم',
            'تعطيل نوع مستخدم',
            'إضافة مربع جديد',
            'تعديل مربع',
            'حذف مربع',
            'إضافة مخيم جديد',
            'تعديل مخيم',
            'حذف مخيم',
            'تغيير حالة مخيم',
            'إضافة تخصيص جديد',
            'تعديل تخصيص',
            'حذف تخصيص',
            'إضافة تصنيف جديد',
            'تعديل تصنيف',
            'حذف تصنيف',
            'إضافة استفسار جديد',
            'تعديل استفسار',
            'حذف استفسار',
            'إنشاء تصنيف استفسارات',
            'تعديل تصنيف استفسارات',
            'حذف تصنيف استفسارات',
            'إنشاء نموذج استفسارات',
            'تعديل نموذج استفسارات',
            'حذف نموذج استفسارات',
            'إضافة طلب تثبيت مخيم',
            'اعتماد طلب تثبيت مخيم',
            'تحديد موعد تسليم',
            'إعادة جدولة موعد محدّد',
            'اعتماد محضر تسليم',
            'تثبيت تسليم مجموعة',
            'تثبيت تسليم الكل',
            'إجابة عن استفسارات محضر تسليم',

        ];

        for ($i = 0; $i < count($data); $i++) {
            LogAction::create([
                'name' => $data[$i],
            ]);
        }
    }
}
